
init_am_directive.init_onload.info=function($scope, $http){
	console.log('-------init_am_directive.init_onload.info--------');
	
	$scope.$watch('read_serverWebSites', function(newValue){if(newValue){
		$scope.serverWebSites = app_config.serverWebSites;
		console.log($scope.app_config.pages)
	}});

	$scope.programRun = {
		info:{programFile:{}},
		capitation_eHealth:{
			clickCapitationMenu:function(k){
				this.k_clickCapitationMenu=k;
				console.log($scope.capitation_eHealth.actors[k]);
			},
		},
		info_page:{
			clickProcess:function(k){
				this.k_clickProcess = k; 
			}
		}
	}

	$scope.info_page={}
	$scope.info_page.processes={
		capitation:{name:'Капітація eHealth',
			title_text:'Процес капітації eHealth прописаний на сайті виробника. <a href="https://portal.ehealth-ukraine.org/join.html"> 🔗 <img alt="eHealth" height="17" src="/f/img/logo_eHealthUA.svg"></a>',
		},
		f25_6_report:{name:'ф.25.6 +звіти',
			title_text:'Процес веденя збору даних по формі 25-6 і контролю по формам звітності ф.12, ф.20 ',
		},
		icpc2:{name:'ICPC2'},
		use_protocol:{name:'використання протоколів'},

	}

	$scope.capitation_eHealth={}
	$scope.capitation_eHealth.docs={
		ds:{name:'ЕЦП'},
		email:{name:'електронна пошта'},
		msp:{name:'документи закладу'},
		documents:{name:'особисті документи (паспорт та податковий номер)'},
	};

	$scope.capitation_eHealth.actors={
		owner:{name:'Керівник медичного закладу',
			algoritmed_info:{
				1:'Ви користуєтесь для <b>капітації eHealth</b> МІС ALGORITMED. <span class="w3-small">Алтернативний перелік МІС ситрифікованих в eHealth на офіційній сторінці <a class="w3-tiny" href="https://portal.ehealth-ukraine.org/providers.html">🔗 eHealth</a>.',
				2:'Введіть данні ЛЗ для реєстрації – <b>Сторінка адміністратора:</b> <a href="/v/hf_data"> данні ЛЗ </a></span>',
			},
			ehealth_info:{
				1:'Обрати одну з <b>медичних інформаційних систем</b> підключених до системи eHealth',
				2:'Заповнити поля про медичний заклад та керівника медичного закладу',
				3:'Накласти ЕЦП керівника медичного закладу',
				4:'Перейти за посиланням у запрошенні до системи eHealth, що прийде на електронну пошту',
				5:'Затвердити обліковий запис користувача для керівника медичного закладу',
				6:'За потреби запросити працівника відділу кадрів',
			},
			docs:{
				ds:{name:'ЕЦП керівника медичного закладу <span class="w3-tiny">(ЕЦП від суб’єкта господарювання для керівника закладу)</span>'},
				email:{name:'робочу адресу електронної пошти'},
				msp:{name:'документи закладу'},
				documents:{name:'особисті документи (паспорт та податковий номер)'},

			}
		},
		physician:{name:'Лікар первинної ланки',
			algoritmed_info:{
				3:'<b>Кабінет лікаря:</b> <a href="/v/ph_declaration">декларація</a>',
			},
			ehealth_info:{
				1:'Перейти за посиланням у <b>запрошенні до системи eHealth</b>, що прийде на електронну пошту',
				2:'Затвердити власний обліковий запис користувача',
				3:'В медичній інформаційній системі перейти до підписання Декларацій з пацієнтами',
				4:'Ввести дані пацієнта у електронну форму Декларації або перевірити достовірність попередньо введених Реєстратором',
				5:'Вказати код, що пацієнт отримав у СМС-повідомленні, або прикріпити фото/скан копії його документів',
				6:'Роздрукувати заповнену Декларацію у двох примірниках: один – пацієнту, один – лікарю.',
				7:'Підписати примірники Декларації разом з пацієнтом.',
				8:'Накласти власний ЕЦП працівника медичного закладу на електронну форму Декларації як підтвердження її підписання',
			},
			docs:{
				ds:{name:'ЕЦП працівника медичного закладу'},
				email:{name:'робочу адресу електронної пошти'},
				documents:{name:'документи пацієнта'},
		}},
		patient:{name:'Пацієнт',
			ehealth_info:{
				1:'На сайті eHealth в розділі “Мапа” ознайомитись з мапою зареєстрованих закладів та лікарів',
				2:'Обрати заклад та лікаря, з яким хотіли б підписати Декларацію',
				3:'Взявши особисті документи, <b>звернутись до закладу</b> <span>Для підписання Декларації з особами, які знаходяться під опікою, необхідно мати: особисті документи опікуна/-ів, документи особи під опікою, та документи, що посвідчують факт представництва (посвідчення або рішення суду)</span>',
				4:'Вказати прізвище обраного лікаря та надати документи для введення даних в електронну форму декларації',
				5:'Перевірити свої дані у роздрукованих примірниках Деклмашенька грищукарації та підписати їх',
				6:'Забрати свій примірник декларації',
			},
			docs:{
				documents:{name:'паспорт або свідоцтво про народження для дитини'},
				ipn:{name:'податковий номер <span class="w3-tiny">за наявності</span>'},
				phone:{name:'мобільний телефон <span class="w3-tiny">за наявності</span>'},
			}
		},
		hrm:{name:'Працівник відділу кадрів',
			algoritmed_info:{
				3:'<b>Відділ кадрів:</b> <a href="/v/employees_cards">🗂 Картки кадрів </a>',
			},
			ehealth_info:{
				1:'Перейти за посиланням у <b>запрошенні до системи eHealth</b>, що прийде на електронну пошту <span class="w3-tiny">Ви отримаєте лист на робочу електронну адресу</span>',
				2:'Затвердити власний обліковий запис користувача',
				3:'В медичній інформаційній системі заповнити поля про кожного лікаря первинної ланки',
			},
			docs:{
				email:{name:'робочу адресу електронної пошти'},
				documents:{name:'особисті документи'},
				documents_physician:{name:'інформацію про особисті документи лікарів'},
				email_physician:{name:'робочу адресу електронної пошти кожного лікаря'},

			}
		},
		registry:{name:'Реєстратура',
			ehealth_info:{
				1:'Обрати одну з <b>медичних інформаційних систем</b> підключених до системи eHealth',
				2:'Заповнити поля про медичний заклад та керівника медичного закладу',
				3:'Накласти ЕЦП керівника медичного закладу',
				4:'Перейти за посиланням у запрошенні до системи eHealth, що прийде на електронну пошту',
				5:'Затвердити обліковий запис користувача для керівника медичного закладу',
				6:'За потреби запросити працівника відділу кадрів',

			},
			docs:{
				email:{name:'робочу адресу електронної пошти'},
				documents:{name:'особисті документи'},
				documents_patients:{name:'документи пацієнта'},
			}
		},
	}
	if(request.parameters.process){
		$scope.programRun.info_page
			.k_clickProcess=request.parameters.process;

	}
	if(request.parameters.tab){
		$scope.programRun.capitation_eHealth
			.clickCapitationMenu(request.parameters.tab)
	}

}
